
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>4. 実装 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="DetailedDesign.md" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    序文
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="Principle.html">
            
                <a href="Principle.html">
            
                    
                    1. 原則
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="BasicDesign.html">
            
                <a href="BasicDesign.html">
            
                    
                    2. 基本設計
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="DetailedDesign.md">
            
                <span>
            
                    
                    3. 詳細設計
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="Implementation.html">
            
                <a href="Implementation.html">
            
                    
                    4. 実装
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >4. 実装</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="4-&#x5B9F;&#x88C5;">4. &#x5B9F;&#x88C5;</h2>
<ol>
<li>&#x65E2;&#x5B58;&#x958B;&#x767A;&#x306E;&#x985E;&#x4F3C;&#x30B3;&#x30FC;&#x30C9;&#x304C;&#x3042;&#x308B;&#x5834;&#x5408;&#x306F;&#x3001;&#x30B3;&#x30D4;&#x30FC;&#x30A2;&#x30F3;&#x30C9;&#x30DA;&#x30FC;&#x30B9;&#x30C8;&#x306A;&#x3069;&#x3067;&#x6D41;&#x7528;&#x3059;&#x308B;&#x3053;&#x3068;&#x3002;&#x81EA;&#x8EAB;&#x306E;&#x30D7;&#x30ED;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x5DE5;&#x6570;&#x3092;&#x77ED;&#x7E2E;&#x3059;&#x308B;&#x3053;&#x3068;&#x3002;&#x5B8C;&#x6210;&#x6E08;&#x306E;&#x30B3;&#x30FC;&#x30C9;&#x306B;&#x30C7;&#x30B0;&#x30EC;&#x7B49;&#x306E;&#x5F71;&#x97FF;&#x3092;&#x4E0E;&#x3048;&#x306A;&#x3044;&#x3088;&#x3046;&#x306B;&#x3059;&#x308B;&#x3053;&#x3068;&#x3002;&#x300C;&#x5BDD;&#x305F;&#x5B50;&#x3092;&#x8D77;&#x3053;&#x3059;&#x306A;&#x3002;&#x300D;</li>
<li>&#x8907;&#x6570;&#x306E;&#x6A5F;&#x80FD;&#x304B;&#x3089;&#x3001;&#x540C;&#x3058;&#x51E6;&#x7406;&#x3092;&#x884C;&#x3046;&#x5834;&#x5408;&#x3001;&#x5171;&#x901A;&#x5316;&#x3088;&#x308A;&#x3082;&#x3001;&#x6A5F;&#x80FD;&#x4ED5;&#x69D8;&#x306E;&#x5909;&#x5316;&#x306B;&#x5BFE;&#x5FDC;&#x3092;&#x512A;&#x5148;&#x3055;&#x305B;&#x308B;&#x305F;&#x3081;&#x3001;&#x5225;&#x3005;&#x306B;&#x4F5C;&#x6210;&#x3059;&#x308B;&#x3053;&#x3068;&#x3002;</li>
<li>&#x30CF;&#x30FC;&#x30C9;&#x6027;&#x80FD;&#x306F;&#x3069;&#x3093;&#x3069;&#x3093;&#x65B0;&#x3057;&#x304F;&#x306A;&#x308B;&#x306E;&#x3067;&#x3001;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306E;&#x6700;&#x9069;&#x5316;&#x306F;&#x8003;&#x3048;&#x306A;&#x304F;&#x3066;&#x3088;&#x3044;&#x3002;</li>
<li>&#x4E8B;&#x6545;&#x9632;&#x6B62;&#x306E;&#x70BA;&#x3001;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DE;&#x304C;&#x4E0D;&#x5177;&#x5408;&#x3084;&#x4ED5;&#x69D8;&#x306E;&#x9593;&#x9055;&#x3044;&#x3092;&#x767A;&#x898B;&#x3057;&#x305F;&#x5834;&#x5408;&#x306F;&#x901F;&#x3084;&#x304B;&#x306B;&#x30EA;&#x30FC;&#x30C0;&#x30FC;&#x306B;&#x5831;&#x544A;&#x3057;&#x3001;&#x6307;&#x793A;&#x3092;&#x5F85;&#x3063;&#x3066;&#x884C;&#x52D5;&#x3059;&#x308B;&#x3053;&#x3068;&#x3002;&#x30EA;&#x30FC;&#x30C0;&#x30FC;&#x306F;&#x3001;&#x9069;&#x6642;&#x3001;&#x53E4;&#x304F;&#x304B;&#x3089;&#x306E;&#x30D9;&#x30C6;&#x30E9;&#x30F3;&#x30E1;&#x30F3;&#x30D0;&#x30FC;&#x3092;&#x62DB;&#x96C6;&#x3057;&#x5354;&#x8B70;&#x3092;&#x304A;&#x3053;&#x306A;&#x3046;&#x3053;&#x3068;&#x3002;</li>
<li>&#x4ED6;&#x306E;&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#x9593;&#x3068;&#x306E;&#x9593;&#x3067;&#x8A2D;&#x8A08;&#x4E0A;&#x306E;&#x554F;&#x984C;&#x304C;&#x767A;&#x751F;&#x3057;&#x305F;&#x5834;&#x5408;&#x306F;&#x3001;&#x6B21;&#x306E;&#x5168;&#x4F53;&#x30DF;&#x30FC;&#x30C6;&#x30A3;&#x30F3;&#x30B0;&#x306E;&#x8B70;&#x984C;&#x3068;&#x3057;&#x3001;&#x90E8;&#x9580;&#x9593;&#x3067;&#x5354;&#x8B70;&#x3059;&#x308B;&#x3053;&#x3068;&#x3002;</li>
<li>&#x30C1;&#x30FC;&#x30E0;&#x30E1;&#x30F3;&#x30D0;&#x30FC;&#x3092;&#x601D;&#x3044;&#x3084;&#x3063;&#x3066;&#x30B3;&#x30FC;&#x30C7;&#x30A3;&#x30F3;&#x30B0;&#x3092;&#x884C;&#x3046;&#x3053;&#x3068;&#x3002;&#x4F8B;&#x3068;&#x3057;&#x3066;&#x306F;&#x3001;&#x4E0D;&#x8981;&#x306B;&#x898B;&#x3048;&#x305F;&#x304B;&#x3089;&#x3068;&#x884C;&#x3063;&#x3066;&#x81EA;&#x5206;&#x306E;&#x90FD;&#x5408;&#x3067;&#x30B3;&#x30E1;&#x30F3;&#x30C8;&#x30A2;&#x30A6;&#x30C8;&#x3055;&#x308C;&#x305F;&#x884C;&#x3092;&#x524A;&#x9664;&#x3057;&#x3066;&#x306F;&#x3044;&#x3051;&#x306A;&#x3044;&#x3002;&#x30C1;&#x30FC;&#x30E0;&#x30E1;&#x30F3;&#x30D0;&#x30FC;&#x306B;&#x3068;&#x3063;&#x3066;&#x610F;&#x5473;&#x306E;&#x3042;&#x308B;&#x3082;&#x306E;&#x304B;&#x3082;&#x3057;&#x308C;&#x306A;&#x3044;&#x306E;&#x3060;&#x304B;&#x3089;&#x3002;&#x307E;&#x305F;&#x3001;&#x52DD;&#x624B;&#x306B;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x540D;&#x3084;&#x95A2;&#x6570;&#x540D;&#x3092;&#x5909;&#x3048;&#x3066;&#x3082;&#x3044;&#x3051;&#x306A;&#x3044;&#x3002;&#x6C7A;&#x307E;&#x3063;&#x305F;&#x3068;&#x3053;&#x308D;&#x306B;&#x6C7A;&#x307E;&#x3063;&#x305F;&#x3082;&#x306E;&#x304C;&#x306A;&#x3044;&#x3068;&#x3001;&#x30C1;&#x30FC;&#x30E0;&#x30E1;&#x30F3;&#x30D0;&#x30FC;&#x304C;&#x898B;&#x3064;&#x3051;&#x3089;&#x308C;&#x306A;&#x3044;&#x304B;&#x3082;&#x3057;&#x308C;&#x306A;&#x3044;&#x3002;</li>
<li>&#x30B9;&#x30D1;&#x30B2;&#x30C3;&#x30C6;&#x30A3;&#x30B3;&#x30FC;&#x30C9;&#x306B;&#x306A;&#x308B;&#x306E;&#x3092;&#x9632;&#x3050;&#x70BA;&#x3001;&#x69CB;&#x9020;&#x7684;&#x306A;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DF;&#x30F3;&#x30B0;&#x3092;&#x884C;&#x3046;&#x3053;&#x3068;&#x3002;&#x5177;&#x4F53;&#x7684;&#x306B;&#x306F;&#x3001;for,while&#x30D6;&#x30ED;&#x30C3;&#x30AF;&#x5185;&#x3067;&#x306E;break,continue&#x306E;&#x7981;&#x6B62;&#x3002;&#x4E0D;&#x8981;&#x306A;return&#x306E;&#x7981;&#x6B62;&#x3002;</li>
<li>&#x30BD;&#x30FC;&#x30B9;&#x30B3;&#x30FC;&#x30C9;&#x3092;&#x4FEE;&#x6B63;&#x3059;&#x308B;&#x5834;&#x5408;&#x3001;&#x5143;&#x306E;&#x30BD;&#x30FC;&#x30B9;&#x30B3;&#x30FC;&#x30C9;&#x306E;&#x30D0;&#x30C3;&#x30AF;&#x30A2;&#x30C3;&#x30D7;&#x306F;&#x6B8B;&#x3057;&#x3066;&#x7F6E;&#x304F;&#x3053;&#x3068;&#x3002;</li>
<li>&#x30D0;&#x30B0;&#x306E;&#x3042;&#x308B;&#x30B3;&#x30FC;&#x30C9;&#x3092;&#x30B3;&#x30DF;&#x30C3;&#x30C8;&#x3059;&#x308B;&#x4E8B;&#x3067;&#x4ED6;&#x306E;&#x4EBA;&#x306B;&#x5F71;&#x97FF;&#x3092;&#x4E0E;&#x3048;&#x305F;&#x308A;&#x3059;&#x308B;&#x4E8B;&#x306E;&#x306A;&#x3044;&#x3088;&#x3046;&#x3001;&#x30EA;&#x30EA;&#x30FC;&#x30B9;&#x6E08;&#x306E;&#x30B3;&#x30FC;&#x30C9;&#x306E;&#x307F;&#x3092;&#x30B3;&#x30DF;&#x30C3;&#x30C8;&#x3059;&#x308B;&#x4E8B;&#x3002;</li>
<li>&#x30B3;&#x30FC;&#x30C7;&#x30A3;&#x30F3;&#x30B0;&#x898F;&#x7D04;&#x3092;&#x8A2D;&#x3051;&#x308B;&#x5834;&#x5408;&#x3001;&#x30B3;&#x30FC;&#x30C9;&#x30EC;&#x30D3;&#x30E5;&#x30FC;&#x3092;&#x884C;&#x3046;&#x3053;&#x3068;&#x3002;&#x898F;&#x7D04;&#x304C;&#x5B88;&#x3089;&#x308C;&#x3066;&#x3044;&#x308B;&#x304B;&#x3069;&#x3046;&#x304B;&#x306E;&#x70B9;&#x307E;&#x3067;&#x30C1;&#x30A7;&#x30C3;&#x30AF;&#x3092;&#x884C;&#x3046;&#x3053;&#x3068;&#x3002;<br>&#x203B;(&#x53C2;&#x8003;)&#x5272;&#x308C;&#x7A93;&#x7406;&#x8AD6;&#x2015;&#x8EFD;&#x5FAE;&#x306A;&#x72AF;&#x7F6A;&#x3082;&#x5FB9;&#x5E95;&#x7684;&#x306B;&#x53D6;&#x308A;&#x7DE0;&#x307E;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001;&#x51F6;&#x60AA;&#x72AF;&#x7F6A;&#x3092;&#x542B;&#x3081;&#x305F;&#x72AF;&#x7F6A;&#x3092;&#x6291;&#x6B62;&#x3067;&#x304D;&#x308B;&#x3068;&#x3059;&#x308B;&#x74B0;&#x5883;&#x72AF;&#x7F6A;&#x5B66;&#x4E0A;&#x306E;&#x7406;&#x8AD6;&#x3002;</li>
</ol>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="DetailedDesign.md" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 3. 詳細設計">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"4. 実装","level":"1.5","depth":1,"previous":{"title":"3. 詳細設計","level":"1.4","depth":1,"path":"DetailedDesign.md","ref":"DetailedDesign.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"Implementation.md","mtime":"2017-02-07T15:41:42.000Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-02-07T15:45:56.656Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

